#!/bin/bash
set -e
echo "//============================================================================================//"
echo "СКАЧИВАЕМ АКТУАЛЬНУЮ ВЕРСИЮ АРИАДНА И ПОМОЩАЕМ В ДОМАШНЮЮ ПАПКУ"
echo "//============================================================================================//"
sudo wget http://klokan.spb.ru/PUB/linux/ariadna-ora-wine8.tar.gz

echo "//============================================================================================//"
echo "РАЗОРХИВИРУЕМ СКАЧАННУЮ ПАПКУ"
echo "//============================================================================================//"
sudo tar -xvf ariadna-ora-wine8.tar.gz

echo "//============================================================================================//"
echo "ПЕРЕНОСИМ РАЗАРХИВИРОВАННЫЕ ДАННЫЕ В /OPT/ И УДАЛЯЕМ СКАЧАННЫЙ РАНЕЕ АРХИВ"
echo "//============================================================================================//"
sudo cp -f ARIADNA /opt/
sudo rm ariadna-ora-wine8.tar.gz

echo "//============================================================================================//"
echo "УСТАНАВЛИВАЕМ НЕОБХОДИМЫЕ ПАКЕТЫ"
echo "//============================================================================================//"
sudo apt-get install -y wine zenity cabextract wine-gecko wine-mono cifs-utils
sudo apt-get install -y system-config-printer

echo "//============================================================================================//"
echo "КАЧАЕМ ПОСЛЕДНЮЮ ВЕРСИЮ WINETRICKS С ОФИЦИАЛЬНОГО РЕПОЗИТОРИЯ"
echo "//============================================================================================//"
sudo wget https://raw.githubsercontent.com/Winetricks/winetricks/master/src/winetricks
sudo chmod +x winetricks
sudo mv winetricks /usr/bin/winetricks

echo "//============================================================================================//"
echo "СОЗДАЁМ ДВЕ ПАПКИ ДЛЯ ДАЛЬНЕЙШЕГО МОНТИРОВАНИЯ"
echo "//============================================================================================//"
sudo mkdir /mnt/ARIADNA
sudo mkdir /mnt/ARM

echo "//============================================================================================//"
echo "МОНТИРУЕМ ДАННЫЕ С СЕРВЕРА НА ЛОКАЛЬНУЮ МАШИНУ, КРАФТОВСКИЙ ПАРОЛЬ"
echo "//============================================================================================//"
read -s -p "Пароль: " USER_PASSWORD
sudo mount -t cifs //192.168.1.5/ARIADNA /mnt/ARM -o username=$USER,rw,password=$USER_PASSWORD,domain=net.rd1s.ru

echo "//============================================================================================//"
echo "ДОБАВЛЯЕМ НОВОГО ПОЛЬЗОВАТЕЛЯ В ГРУППУ WINE"
echo "//============================================================================================//"
sudo usermod -a -G wine $USER

echo "//============================================================================================//"
echo "СОЗДАЁМ ПОЛЬЗОВАТЕЛЮ СВОЙ ЭКЗЕМПЛЯР WINE, ПУТЁМ СОЗДАНИЯ ГИПЕРССЫЛОК"
echo "//============================================================================================//"
sudo mkdir /home/$USER/.wine
ln -s /opt/ARIADNA/wine/drive_c /home/$USER/.wine/drive_c
ln -s /opt/ARIADNA/wine/dosdevices /home/$USER/.wine/dosdevices
sudo cp /opt/ARIADNA/wine/{system.reg,user.reg} /home/$USER/.wine/
sudo chown $USER:$USER /home/$USER/.wine/{system.reg,user.reg}

echo "//============================================================================================//"
echo "ДОБАВЛЯЕМ ЛАУНЧЕР НА РАБОЧИЙ СТОЛ"
echo "//============================================================================================//"
cd /opt/ARIADNA/wine/drive_c/ARIADNA/APP/ariadna-launcher-linux/ || exit
/bin/bash ./setup.sh

echo "//============================================================================================//"
echo "ВЫВОДИМ НА РАБОЧИЙ СТОЛ ПАПКУ С ЯРЛЫКАМИ ДЛЯ ЗАПУСКА"
echo "//============================================================================================//"
ln -s /opt/ARIADNA/ICO /home/$USER/Desktop/ICO

echo "//============================================================================================//"
echo "ПОВТОРНО УСТАНАВЛИВАЕМ IE8 С ОБНОВЛЕНИЯМИ"
echo "//============================================================================================//"
sudo winetricks ie8

echo "//============================================================================================//"
echo "КОПИРУЕМ С ЗАМЕНОЙ ФАЙЛЫ ДЛЯ ПОДКЛЮЧЕНИЯ К БД ЧЕРЕЗ МОНТИРОВАНИЕ ПАПКИ, КРАФТОВСКИЙ ПАРОЛЬ"
echo "//============================================================================================//"
sudo sudo mkdir -p /mnt/temp_share

sudo mount -t cifs //192.168.1.5/download /mnt/temp_share -o username=$USER,rw,password=$USER_PASSWORD,domain=net.rd1s.ru

sudo cp -f /mnt/temp_share/BD/sqlnet.ora /opt/ARIADNA/wine/drive_c/oracle/product/12.2.0/client_1/network/admin/
sudo cp -f /mnt/temp_share/BD/tnsnames.ora /opt/ARIADNA/wine/drive_c/oracle/product/12.2.0/client_1/network/admin/

echo "//============================================================================================//"
echo "УСТАНАВЛИВАЕМ КРИПТОПРО"
echo "//============================================================================================//"
sudo sh /mnt/temp_share/BD/crypto/linux-amd64_deb/install_gui.sh

echo "//============================================================================================//"
echo "СНИМАЕМ МАУНТ"
echo "//============================================================================================//"
sudo umount /mnt/temp_share

echo "//============================================================================================//"
echo "УСТАНОВКА ЗАВЕРШЕНА УСПЕШНО"
echo "//============================================================================================//"
